[Name]
af = 南非荷兰语
af-ZA = 南非荷兰语(南非)
am = 阿姆哈拉语
am-ET = 阿姆哈拉语(埃塞俄比亚)
ar = 阿拉伯语
ar-AE = 阿拉伯语(阿拉伯联合酋长国)
ar-BH = 阿拉伯语(巴林)
ar-DZ = 阿拉伯语(阿尔及利亚)
ar-EG = 阿拉伯语(埃及)
ar-IQ = 阿拉伯语(伊拉克)
ar-JO = 阿拉伯语(约旦)
ar-KW = 阿拉伯语(科威特)
ar-LB = 阿拉伯语(黎巴嫩)
ar-LY = 阿拉伯语(利比亚)
ar-MA = 阿拉伯语(摩洛哥)
ar-OM = 阿拉伯语(阿曼)
ar-QA = 阿拉伯语(卡塔尔)
ar-SA = 阿拉伯语(沙特阿拉伯)
ar-SY = 阿拉伯语(叙利亚)
ar-TN = 阿拉伯语(突尼斯)
ar-YE = 阿拉伯语(也门)
arn = 马普丹冈语
arn-CL = 马普丹冈语(智利)
as = 阿萨姆语
as-IN = 阿萨姆语(印度)
az = 阿泽里语
az-Cyrl-AZ = 阿泽里语(西里尔语，阿塞拜疆)
az-Latn-AZ = 阿泽里语(拉丁语，阿塞拜疆)
ba = 巴什基尔语
ba-RU = 巴什基尔语(俄罗斯)
be = 白俄罗斯语
be-BY = 白俄罗斯语(白俄罗斯)
bg = 保加利亚语
bg-BG = 保加利亚语(保加利亚)
bn = 孟加拉语(印度)
bn-BD = 孟加拉语(孟加拉国)
bn-IN = 孟加拉语(印度)
bo = 藏语
bo-CN = 藏语(中国)
br = 布里多尼语
br-FR = 布里多尼语(法国)
bs = 波斯尼亚语
bs-Cyrl-BA = 波斯尼亚语(西里尔文，波斯尼亚和黑塞哥维那)
bs-Latn-BA = 波斯尼亚语(拉丁语，波斯尼亚和黑塞哥维那)
ca = 加泰罗尼亚语
ca-ES = 加泰罗尼亚语(加泰罗尼亚语)
co = 科西嘉语
co-FR = 科西嘉语(法国)
cs = 捷克语
cs-CZ = 捷克语(捷克)
cy = 威尔士语
cy-GB = 威尔士语(英国)
da = 丹麦语
da-DK = 丹麦语(丹麦)
de = 德语
de-AT = 德语(奥地利)
de-CH = 德语(瑞士)
de-DE = 德语(德国)
de-LI = 德语(列支敦士登)
de-LU = 德语(卢森堡)
dsb = 下索布语
dsb-DE = 下索布语(德国)
dv = 第维埃语
dv-MV = 第维埃语(马尔代夫语)
el = 希腊语
el-GR = 希腊语(希腊)
en = 英语
en-029 = 英语(加勒比海)
en-AU = 英语(澳大利亚)
en-BZ = 英语(伯利兹)
en-CA = 英语(加拿大)
en-GB = 英语(英国)
en-IE = 英语(爱尔兰)
en-IN = 英语(印度)
en-JM = 英语(牙买加)
en-MY = 英语(马来西亚)
en-NZ = 英语(新西兰)
en-PH = 英语(菲律宾)
en-SG = 英语(新加坡)
en-TT = 英语(特立尼达和多巴哥)
en-US = 英语(美国)
en-ZA = 英语(南非)
en-ZW = 英语(津巴布韦)
eo = 世界语
es = 西班牙语
es-AR = 西班牙语(阿根廷)
es-BO = 西班牙语(玻利维亚)
es-CL = 西班牙语(智利)
es-CO = 西班牙语(哥伦比亚)
es-CR = 西班牙语(哥斯达黎加)
es-DO = 西班牙语(多米尼加)
es-EC = 西班牙语(厄瓜多尔)
es-ES = 西班牙语(西班牙)
es-GT = 西班牙语(危地马拉)
es-HN = 西班牙语(洪都拉斯)
es-MX = 西班牙语(墨西哥)
es-NI = 西班牙语(尼加拉瓜)
es-PA = 西班牙语(巴拿马)
es-PE = 西班牙语(秘鲁)
es-PR = 西班牙语(波多黎各)
es-PY = 西班牙语(巴拉圭)
es-SV = 西班牙语(萨尔瓦多)
es-US = 西班牙语(美国)
es-UY = 西班牙语(乌拉圭)
es-VE = 西班牙语(委内瑞拉)
et = 爱沙尼亚语
et-EE = 爱沙尼亚语(爱沙尼亚)
eu = 巴斯克语
eu-ES = 巴斯克语(巴斯克语)
fa = 波斯语
fa-IR = 波斯语(伊朗)
fi = 芬兰语
fi-FI = 芬兰语(芬兰)
fil = 菲律宾语
fil-PH = 菲律宾语(菲律宾)
fo = 法罗语
fo-FO = 法罗语(法罗群岛)
fr = 法语
fr-BE = 法语(比利时)
fr-CA = 法语(加拿大)
fr-CH = 法语(瑞士)
fr-FR = 法语(法国)
fr-LU = 法语(卢森堡)
fr-MC = 法语(摩纳哥公国)
fy = 弗里西亚语
fy-NL = 弗里西亚语(荷兰)
ga = 爱尔兰语
ga-IE = 爱尔兰语(爱尔兰)
gl = 加利西亚语
gl-ES = 加利西亚语(加利西亚语)
gsw = 阿尔萨斯语
gsw-FR = 阿尔萨斯语(法国)
gu = 古吉拉特语
gu-IN = 古吉拉特语(印度)
ha = 豪撒语
ha-Latn-NG = 豪撒语(拉丁语，尼日利亚)
iw = 希伯来语
he = 希伯来语
he-IL = 希伯来语(以色列)
hi = 印地语
hi-IN = 印地语(印度)
hr = 克罗地亚语
hr-BA = 克罗地亚语(拉丁语，波斯尼亚和黑塞哥维那)
hr-HR = 克罗地亚语(克罗地亚)
hsb = 上索布语
hsb-DE = 上索布语(德国)
ht = 海地克里奥尔语
hu = 匈牙利语
hu-HU = 匈牙利语(匈牙利)
hy = 亚美尼亚语
hy-AM = 亚美尼亚语(亚美尼亚)
ia = 拉丁国际语
id = 印度尼西亚语
id-ID = 印度尼西亚语(印度尼西亚)
ig = 伊博语
ig-NG = 伊博语(尼日利亚)
ii = 彝语
ii-CN = 彝语(中国)
is = 冰岛语
is-IS = 冰岛语(冰岛)
it = 意大利语
it-CH = 意大利语(瑞士)
it-IT = 意大利语(意大利)
iu = 因纽特语
iu-Cans-CA = 因纽特语(音节，加拿大)
iu-Latn-CA = 因纽特语(拉丁语，加拿大)
ja = 日语
ja-JP = 日语(日本)
ka = 格鲁吉亚语
ka-GE = 格鲁吉亚语(格鲁吉亚)
kk = 哈萨克语
kk-KZ = 哈萨克语(哈萨克斯坦)
kl = 格陵兰语
kl-GL = 格陵兰语(格陵兰)
km = 高棉语
km-KH = 高棉语(柬埔寨)
kn = 卡纳达语
kn-IN = 卡纳达语(印度)
ko = 韩语
ko-KR = 韩语(韩国)
kok = 贡根语
kok-IN = 贡根语(印度)
ky = 吉尔吉斯语
ky-KG = 吉尔吉斯语(吉尔吉斯坦)
la = 拉丁语
lb = 卢森堡语
lb-LU = 卢森堡语(卢森堡)
lo = 老挝语
lo-LA = 老挝语(老挝)
lt = 立陶宛语
lt-LT = 立陶宛语(立陶宛)
lv = 拉脱维亚语
lv-LV = 拉脱维亚语(拉脱维亚)
mi = 毛利语
mi-NZ = 毛利语(新西兰)
mk = 马其顿语
mk-MK = 马其顿语(前南斯拉夫联盟马其顿共和国)
ml = 马拉雅拉姆语
ml-IN = 马拉雅拉姆语(印度)
mn = 蒙古语
mn-MN = 蒙古语(西里尔语、蒙古)
mn-Mong-CN = 蒙古语(传统蒙古语，中国)
mnc = 满语
moh = 莫霍克语
moh-CA = 莫霍克语(莫霍克)
mr = 马拉地语
mr-IN = 马拉地语(印度)
ms = 马来语
ms-BN = 马来语(文莱达鲁萨兰)
ms-MY = 马来语(马来西亚)
mt = 马耳他语
mt-MT = 马耳他语(马耳他)
my = 缅甸语
ne = 尼泊尔语
ne-Deva = 尼泊尔语(梵文天城体)
ne-NP = 尼泊尔语(尼泊尔)
nl = 荷兰语
nl-BE = 荷兰语(比利时)
nl-NL = 荷兰语(荷兰)
no = 挪威语
nb-NO = 挪威语、伯克梅尔(挪威)
nn-NO = 挪威语、尼诺斯克(挪威)
nso = 巴索托语
nso-ZA = 巴索托语(南非)
oc = 奥克西唐语
oc-FR = 奥克西唐语(法国)
or = 奥里雅语
or-IN = 奥里雅语(印度)
pa = 旁遮普语
pa-IN = 旁遮普语(印度)
pl = 波兰语
pl-PL = 波兰语(波兰)
prs = 达里语
prs-AF = 达里语(阿富汗)
ps = 普什图语
ps-AF = 普什图语(阿富汗)
pt = 葡萄牙语
pt-BR = 葡萄牙语(巴西)
pt-PT = 葡萄牙语(葡萄牙)
qut = 基切语
qut-GT = 基切语(危地马拉)
quz = 克丘亚语
quz-BO = 克丘亚语(玻利维亚)
quz-EC = 克丘亚语(厄瓜多尔)
quz-PE = 克丘亚语(秘鲁)
rm = 罗曼什语
rm-CH = 罗曼什语(瑞士)
ro = 罗马尼亚语
ro-RO = 罗马尼亚语(罗马尼亚)
ru = 俄语
ru-RU = 俄语(俄罗斯)
rw = 卢旺达语
rw-RW = 卢旺达语(卢旺达)
sa = 梵语
sa-IN = 梵语(印度)
sah = 雅库特语
sah-RU = 雅库特语(俄罗斯)
se = 萨米语
se-FI = 北萨米语(芬兰)
se-NO = 北萨米语(挪威)
se-SE = 北萨米语(瑞典)
sma-NO = 南萨米语(挪威)
sma-SE = 南萨米语(瑞典)
smj-NO = 律勒萨米语(挪威)
smj-SE = 律勒萨米语(瑞典)
smn-FI = 伊纳里萨米语(芬兰)
sms-FI = 斯科特萨米语(芬兰)
si = 僧伽罗语
si-LK = 僧伽罗语(斯里兰卡)
sk = 斯洛伐克语
sk-SK = 斯洛伐克语(斯洛伐克)
sl = 斯洛文尼亚语
sl-SI = 斯洛文尼亚语(斯洛文尼亚)
sq = 阿尔巴尼亚语
sq-AL = 阿尔巴尼亚语(阿尔巴尼亚)
sr = 塞尔维亚语
sr-Cyrl-BA = 塞尔维亚语(西里尔文，波斯尼亚和黑塞哥维那)
sr-Cyrl-CS = 塞尔维亚语(西里尔语、塞尔维亚)
sr-Latn-BA = 塞尔维亚语(拉丁语，波斯尼亚和黑塞哥维那)
sr-Latn-CS = 塞尔维亚语(拉丁语、塞尔维亚)
sv = 瑞典语
sv-FI = 瑞典语(芬兰)
sv-SE = 瑞典语(瑞典)
sw = 斯瓦希里语
sw-KE = 斯瓦希里语(肯尼亚)
syr = 叙利亚语
syr-SY = 叙利亚语(叙利亚)
ta = 泰米尔语
ta-IN = 泰米尔语(印度)
te = 泰卢固语
te-IN = 泰卢固语(印度)
tg = 塔吉克语
tg-Cyrl-TJ = 塔吉克语(西里尔文，塔吉克斯坦)
th = 泰语
th-TH = 泰语(泰国)
tk = 土库曼语
tk-TM = 土库曼语(土库曼斯坦)
tl = 塔加路语
tn = 茨瓦纳语
tn-ZA = 茨瓦纳语(南非)
tr = 土耳其语
tr-TR = 土耳其语(土耳其)
tt = 鞑靼语
tt-RU = 鞑靼语(俄罗斯)
tzm = 塔马塞特语
tzm-Latn-DZ = 塔马塞特语(拉丁语，阿尔及利亚)
ug = 维吾尔语
ug-CN = 维吾尔语(中国)
uk = 乌克兰语
uk-UA = 乌克兰语(乌克兰)
ur = 乌尔都语
ur-PK = 乌尔都语(巴基斯坦)
uz = 乌兹别克语
uz-Cyrl-UZ = 乌兹别克语(西里尔语，乌兹别克斯坦)
uz-Latn-UZ = 乌兹别克语(拉丁语，乌兹别克斯坦)
vi = 越南语
vi-VN = 越南语(越南)
wo = 沃洛夫语
wo-SN = 沃洛夫语(塞内加尔)
xh = 索萨语
xh-ZA = 索萨语(南非)
yi = 意第绪语
yo = 约鲁巴语
yo-NG = 约鲁巴语(尼日利亚)
zh = 中文
zh-CN = 中文(简体)
zh-HK = 中文(香港)
zh-Hans = 中文(简体)
zh-Hant = 中文(繁体)
zh-MO = 中文(澳门)
zh-SG = 中文(新加坡)
zh-TW = 中文(繁体)
zu = 祖鲁语
zu-ZA = 祖鲁语(南非)
